{
	"aboutTitle": "About Legacy Restoration",
	"aboutContent": [
		"Legacy&rsquo;s mitigation and restoration services stand the test of time. Our management group has over 75 years of proven industry experience. We will focus our expertise on getting you back on track after you&rsquo;ve endured the worst hardships imaginable. While disasters strike suddenly and turn your whole life upside down, our team is prepared to move in fast. Contact us and we will immediately begin the process of getting your property repaired. With bases throughout the country, along with our international support network, Legacy Restoration will be there when you need us most. We help customers recover from disasters of all sizes. Even when you&rsquo;ve lost all hope, we have a solution. We&rsquo;ve seen it all. Our nation-wide team is ready to restore your property quickly, no matter what the circumstances. You can rest peacefully, knowing that the top team in the industry is here to help.",
		"Fire damage mitigation is a two-step process. First, we start by drying everything out and removing any water damage. Fires cause water damage in a number of ways: water from firefighters, damaged pipes and possible rain or snow while the fire happens. We dry out any water residue/humidity and remove anything that is damaged. The second step is clearing the smoke damage. Soot residue needs to be removed immediately. We reach the smallest areas of the home to clear smoke damage and deodorize your property. Then, we can begin rebuilding."
	],
	"branch": [
		"Tampa: 813-498-1357",
		"Fort Myers: 239-329-5982"
	],
	"aboutSubTitle": "We Specialize in Disaster Restoration",
	"servicesContent": [
		"Fire damage mitigation is a two-step process. First, we start by drying everything out and removing any water damage. Fires cause water damage in a number of ways: water from firefighters, damaged pipes and possible rain or snow while the fire happens. We dry out any water residue/humidity and remove anything that is damaged. The second step is clearing the smoke damage. Soot residue needs to be removed immediately. We reach the smallest areas of the home to clear smoke damage and deodorize your property. Then, we can begin rebuilding.",
		"Water damage mitigation starts by stopping water from spreading to other areas. After that, we remove any water and dry out the property. That also includes removing moisture from the air with dehumidifiers. Electrical, flooring and drywall may need to be removed to prevent the spread of mold. After all the water-damaged materials are dried or removed, we can start the process of restoring your property.",
		"After a storm, we remove any debris and damaged items. One of the biggest concerns with storm damage mitigation is water. We must remove anything the water touched to prevent further damage and ensure a safe environment. After all the damage is removed, then we can begin restoration.",
		"Mold damage remediation is a multi-step process. The initial step is identifying the source of the mold and applying an antimicrobial to stop its spread. Containment is key. We then scrub the air by creating evaporation and drying it out. This ensures that mold spores and other airborne debris are removed. The only way to properly repair the damage it to remove any mold-touch areas. That could include removing carpet, wood trim, drywall, insulation and even furniture. After all the mold is removed, we will replace and repair all the affected areas.",
		null,
		null,
		null
	],
	"copyrightContent": "© Copyright 2023, Legacy Restoration, LLC",
	"phoneLink": "tel:+18882495867",
	"phoneNumber": "888-249-5867",
	"phoneText": "Our disaster recovery team is always available. Call any time and our experts will work tirelessly to get your life back on track."
}